𝐜𝐨𝐧𝐬𝐭 { 𝐆𝐨𝐚𝐭𝐖𝐫𝐚𝐩𝐩𝐞𝐫 } = 𝐫𝐞𝐪𝐮𝐢𝐫𝐞("𝐟𝐜𝐚-𝐥𝐢𝐚𝐧𝐞-𝐮𝐭𝐢𝐥𝐬");
𝐜𝐨𝐧𝐬𝐭 𝐟𝐬 = 𝐫𝐞𝐪𝐮𝐢𝐫𝐞("𝐟𝐬-𝐞𝐱𝐭𝐫𝐚");
𝐜𝐨𝐧𝐬𝐭 𝐚𝐱𝐢𝐨𝐬 = 𝐫𝐞𝐪𝐮𝐢𝐫𝐞("𝐚𝐱𝐢𝐨𝐬");
𝐜𝐨𝐧𝐬𝐭 𝐩𝐚𝐭𝐡 = 𝐫𝐞𝐪𝐮𝐢𝐫𝐞("𝐩𝐚𝐭𝐡");
𝐜𝐨𝐧𝐬𝐭 { 𝐠𝐞𝐭𝐏𝐫𝐞𝐟𝐢𝐱 } = 𝐠𝐥𝐨𝐛𝐚𝐥.𝐮𝐭𝐢𝐥𝐬;
𝐜𝐨𝐧𝐬𝐭 { 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬, 𝐚𝐥𝐢𝐚𝐬𝐞𝐬 } = 𝐠𝐥𝐨𝐛𝐚𝐥.𝐆𝐨𝐚𝐭𝐁𝐨𝐭;
𝐜𝐨𝐧𝐬𝐭 𝐝𝐨𝐍𝐨𝐭𝐃𝐞𝐥𝐞𝐭𝐞 = "[ 𝐅 𝐀 𝐇 𝐀 𝐃 ]"; // 𝐜𝐡𝐚𝐧𝐠𝐢𝐧𝐠 𝐭𝐡𝐢𝐬 𝐰𝐨𝐧𝐭 𝐜𝐡𝐚𝐧𝐠𝐞 𝐭𝐡𝐞 𝐠𝐨𝐚𝐭𝐛𝐨𝐭 𝐕𝟐 𝐨𝐟 𝐥𝐢𝐬𝐭 𝐜𝐦𝐝 𝐢𝐭 𝐢𝐬 𝐣𝐮𝐬𝐭 𝐚 𝐝𝐞𝐜𝐨𝐲𝐲

𝐦𝐨𝐝𝐮𝐥𝐞.𝐞𝐱𝐩𝐨𝐫𝐭𝐬 = {
  𝐜𝐨𝐧𝐟𝐢𝐠: {
    𝐧𝐚𝐦𝐞: "𝐡𝐞𝐥𝐩",
    𝐯𝐞𝐫𝐬𝐢𝐨𝐧: "𝟏.𝟏𝟕",
    𝐚𝐮𝐭𝐡𝐨𝐫: "𝐍𝐈𝐒𝐀𝐍",
    𝐮𝐬𝐞𝐏𝐫𝐞𝐟𝐢𝐱: 𝐟𝐚𝐥𝐬𝐞,
    𝐜𝐨𝐮𝐧𝐭𝐃𝐨𝐰𝐧: 𝟓,
    𝐫𝐨𝐥𝐞: 𝟎,
    𝐬𝐡𝐨𝐫𝐭𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧: {
      𝐞𝐧: "𝐕𝐢𝐞𝐰 𝐜𝐨𝐦𝐦𝐚𝐧𝐝 𝐮𝐬𝐚𝐠𝐞 𝐚𝐧𝐝 𝐥𝐢𝐬𝐭 𝐚𝐥𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐝𝐢𝐫𝐞𝐜𝐭𝐥𝐲",
    },
    𝐥𝐨𝐧𝐠𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧: {
      𝐞𝐧: "𝐕𝐢𝐞𝐰 𝐜𝐨𝐦𝐦𝐚𝐧𝐝 𝐮𝐬𝐚𝐠𝐞 𝐚𝐧𝐝 𝐥𝐢𝐬𝐭 𝐚𝐥𝐥 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬 𝐝𝐢𝐫𝐞𝐜𝐭𝐥𝐲",
    },
    𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲: "𝐢𝐧𝐟𝐨",
    𝐠𝐮𝐢𝐝𝐞: {
      𝐞𝐧: "{𝐩𝐧} / 𝐡𝐞𝐥𝐩 𝐜𝐦𝐝𝐍𝐚𝐦𝐞 ",
    },
    𝐩𝐫𝐢𝐨𝐫𝐢𝐭𝐲: 𝟏,
  },

  𝐨𝐧𝐒𝐭𝐚𝐫𝐭: 𝐚𝐬𝐲𝐧𝐜 𝐟𝐮𝐧𝐜𝐭𝐢𝐨𝐧 ({ 𝐦𝐞𝐬𝐬𝐚𝐠𝐞, 𝐚𝐫𝐠𝐬, 𝐞𝐯𝐞𝐧𝐭, 𝐭𝐡𝐫𝐞𝐚𝐝𝐬𝐃𝐚𝐭𝐚, 𝐫𝐨𝐥𝐞 }) {
    𝐜𝐨𝐧𝐬𝐭 { 𝐭𝐡𝐫𝐞𝐚𝐝𝐈𝐃 } = 𝐞𝐯𝐞𝐧𝐭;
    𝐜𝐨𝐧𝐬𝐭 𝐭𝐡𝐫𝐞𝐚𝐝𝐃𝐚𝐭𝐚 = 𝐚𝐰𝐚𝐢𝐭 𝐭𝐡𝐫𝐞𝐚𝐝𝐬𝐃𝐚𝐭𝐚.𝐠𝐞𝐭(𝐭𝐡𝐫𝐞𝐚𝐝𝐈𝐃);
    𝐜𝐨𝐧𝐬𝐭 𝐩𝐫𝐞𝐟𝐢𝐱 = 𝐠𝐞𝐭𝐏𝐫𝐞𝐟𝐢𝐱(𝐭𝐡𝐫𝐞𝐚𝐝𝐈𝐃);

    𝐢𝐟 (𝐚𝐫𝐠𝐬.𝐥𝐞𝐧𝐠𝐭𝐡 === 𝟎) {
      𝐜𝐨𝐧𝐬𝐭 𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬 = {};
      𝐥𝐞𝐭 𝐦𝐬𝐠 = "";

      𝐦𝐬𝐠 += ``; // 𝐫𝐞𝐩𝐥𝐚𝐜𝐞 𝐰𝐢𝐭𝐡 𝐲𝐨𝐮𝐫 𝐧𝐚𝐦𝐞 

      𝐟𝐨𝐫 (𝐜𝐨𝐧𝐬𝐭 [𝐧𝐚𝐦𝐞, 𝐯𝐚𝐥𝐮𝐞] 𝐨𝐟 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬) {
        𝐢𝐟 (𝐯𝐚𝐥𝐮𝐞.𝐜𝐨𝐧𝐟𝐢𝐠.𝐫𝐨𝐥𝐞 > 𝟏 && 𝐫𝐨𝐥𝐞 < 𝐯𝐚𝐥𝐮𝐞.𝐜𝐨𝐧𝐟𝐢𝐠.𝐫𝐨𝐥𝐞) 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞;

        𝐜𝐨𝐧𝐬𝐭 𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲 = 𝐯𝐚𝐥𝐮𝐞.𝐜𝐨𝐧𝐟𝐢𝐠.𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲 || "𝐔𝐧𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐳𝐞𝐝";
        𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬[𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲] = 𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬[𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲] || { 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬: [] };
        𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬[𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲].𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬.𝐩𝐮𝐬𝐡(𝐧𝐚𝐦𝐞);
      }

      𝐎𝐛𝐣𝐞𝐜𝐭.𝐤𝐞𝐲𝐬(𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬).𝐟𝐨𝐫𝐄𝐚𝐜𝐡((𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲) => {
        𝐢𝐟 (𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲 !== "𝐢𝐧𝐟𝐨") {
          𝐦𝐬𝐠 += `\𝐧╭─────❃『  📛${𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲.𝐭𝐨𝐔𝐩𝐩𝐞𝐫𝐂𝐚𝐬𝐞()} 🦆💨 』`;

          𝐜𝐨𝐧𝐬𝐭 𝐧𝐚𝐦𝐞𝐬 = 𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐢𝐞𝐬[𝐜𝐚𝐭𝐞𝐠𝐨𝐫𝐲].𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬.𝐬𝐨𝐫𝐭();
          𝐟𝐨𝐫 (𝐥𝐞𝐭 𝐢 = 𝟎; 𝐢 < 𝐧𝐚𝐦𝐞𝐬.𝐥𝐞𝐧𝐠𝐭𝐡; 𝐢 += 𝟑) {
            𝐜𝐨𝐧𝐬𝐭 𝐜𝐦𝐝𝐬 = 𝐧𝐚𝐦𝐞𝐬.𝐬𝐥𝐢𝐜𝐞(𝐢, 𝐢 + 𝟐).𝐦𝐚𝐩((𝐢𝐭𝐞𝐦) => `✨${𝐢𝐭𝐞𝐦}✨`);
            𝐦𝐬𝐠 += `\𝐧│${𝐜𝐦𝐝𝐬.𝐣𝐨𝐢𝐧(" ".𝐫𝐞𝐩𝐞𝐚𝐭(𝐌𝐚𝐭𝐡.𝐦𝐚𝐱(𝟏, 𝟓 - 𝐜𝐦𝐝𝐬.𝐣𝐨𝐢𝐧("").𝐥𝐞𝐧𝐠𝐭𝐡)))}`;
          }

          𝐦𝐬𝐠 += `\𝐧╰────────────✦`;
        }
      });

      𝐜𝐨𝐧𝐬𝐭 𝐭𝐨𝐭𝐚𝐥𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 = 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬.𝐬𝐢𝐳𝐞;
      𝐦𝐬𝐠 += `\𝐧\𝐧╭─────❃[🦆𝙴𝙽𝙹𝙾𝚈🦆] |[𝚈𝙾𝚄𝚁 𝙳𝙸𝙳𝙰𝚁]\𝐧 | [ 🦆𝙹𝙾𝙸𝙽 𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿 𝚃𝚈𝙿𝙴: ${𝐩𝐫𝐞𝐟𝐢𝐱}𝚂𝚄𝙿𝙿𝙾𝚁𝚃𝙶𝙲 ]\𝐧 | [🧠𝙳𝙰𝚈𝚁𝙴𝙲𝚃 𝙶𝚁𝙾𝚄𝙿 𝙻𝙸𝙽𝙺: //𝐦.𝐦𝐞/𝐣/𝐀𝐛𝐙𝐆𝐟𝐈𝐝𝐞𝐬𝟖𝐪𝐝𝐳𝐣𝐬𝐲/ ]\𝐧│>𝚃𝙾𝚃𝙰𝙻 𝙲𝙼𝙳𝚂: [🧠${𝐭𝐨𝐭𝐚𝐥𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬}🦆].\𝐧│𝚃𝚈𝙿𝙴:[ 🦆${𝐩𝐫𝐞𝐟𝐢𝐱}𝙷𝙴𝙻𝙿 𝚃𝙾🦆\𝐧│🦆<𝙲𝙼𝙳> 𝚃𝙾 𝙻𝙴𝙰𝚁𝙽 𝚃𝙷𝙴 𝚄𝚂𝙰𝙶𝙴.]\𝐧╰────────────✦`;
      𝐦𝐬𝐠 += ``;
      𝐦𝐬𝐠 += `\𝐧╭─────❃\𝐧│ 🌟 | [📛𝙶𝙾𝙰𝚃𝙱𝙾𝚃📛│𝙾𝚆𝙽𝙴𝚁 𝙵𝙱 𝙸𝙳: //https://www.facebook.com/your.real.dad.cxly\𝐧╰────────────✦`; 

      𝐜𝐨𝐧𝐬𝐭 𝐚𝐭𝐭𝐚𝐜𝐡𝐦𝐞𝐧𝐭 = 𝐚𝐰𝐚𝐢𝐭 𝐚𝐱𝐢𝐨𝐬.𝐠𝐞𝐭("𝐡𝐭𝐭𝐩𝐬://𝐝𝐫𝐢𝐯𝐞.𝐠𝐨𝐨𝐠𝐥𝐞.𝐜𝐨𝐦/𝐮𝐜?𝐞𝐱𝐩𝐨𝐫𝐭=𝐝𝐨𝐰𝐧𝐥𝐨𝐚𝐝&𝐢𝐝=𝟏𝐓𝐨𝟖𝐅𝐊𝐗𝐔𝐦𝟔𝐍𝐂𝐤_𝐮𝐡𝐖𝐱𝐟𝐈𝐪𝐛𝐛-𝐅𝐧𝟏𝐇𝐯-𝐄𝐩𝐯", { 𝐫𝐞𝐬𝐩𝐨𝐧𝐬𝐞𝐓𝐲𝐩𝐞: "𝐬𝐭𝐫𝐞𝐚𝐦" });

      𝐚𝐰𝐚𝐢𝐭 𝐦𝐞𝐬𝐬𝐚𝐠𝐞.𝐫𝐞𝐩𝐥𝐲({
        𝐛𝐨𝐝𝐲: 𝐦𝐬𝐠,
        𝐚𝐭𝐭𝐚𝐜𝐡𝐦𝐞𝐧𝐭: 𝐚𝐭𝐭𝐚𝐜𝐡𝐦𝐞𝐧𝐭.𝐝𝐚𝐭𝐚,
      });
    } 𝐞𝐥𝐬𝐞 {
      𝐜𝐨𝐧𝐬𝐭 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐍𝐚𝐦𝐞 = 𝐚𝐫𝐠𝐬[𝟎].𝐭𝐨𝐋𝐨𝐰𝐞𝐫𝐂𝐚𝐬𝐞();
      𝐜𝐨𝐧𝐬𝐭 𝐜𝐨𝐦𝐦𝐚𝐧𝐝 = 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬.𝐠𝐞𝐭(𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐍𝐚𝐦𝐞) || 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬.𝐠𝐞𝐭(𝐚𝐥𝐢𝐚𝐬𝐞𝐬.𝐠𝐞𝐭(𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐍𝐚𝐦𝐞));

      𝐢𝐟 (!𝐜𝐨𝐦𝐦𝐚𝐧𝐝) {
        𝐚𝐰𝐚𝐢𝐭 𝐦𝐞𝐬𝐬𝐚𝐠𝐞.𝐫𝐞𝐩𝐥𝐲(`𝐂𝐨𝐦𝐦𝐚𝐧𝐝 "${𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐍𝐚𝐦𝐞}" 𝐧𝐨𝐭 𝐟𝐨𝐮𝐧𝐝.`);
      } 𝐞𝐥𝐬𝐞 {
        𝐜𝐨𝐧𝐬𝐭 𝐜𝐨𝐧𝐟𝐢𝐠𝐂𝐨𝐦𝐦𝐚𝐧𝐝 = 𝐜𝐨𝐦𝐦𝐚𝐧𝐝.𝐜𝐨𝐧𝐟𝐢𝐠;
        𝐜𝐨𝐧𝐬𝐭 𝐫𝐨𝐥𝐞𝐓𝐞𝐱𝐭 = 𝐫𝐨𝐥𝐞𝐓𝐞𝐱𝐭𝐓𝐨𝐒𝐭𝐫𝐢𝐧𝐠(𝐜𝐨𝐧𝐟𝐢𝐠𝐂𝐨𝐦𝐦𝐚𝐧𝐝.𝐫𝐨𝐥𝐞);
        𝐜𝐨𝐧𝐬𝐭 𝐨𝐭𝐡𝐞𝐫𝐍𝐚𝐦𝐞=(𝐜𝐨𝐧𝐟𝐢𝐠𝐂𝐨𝐦𝐦𝐚𝐧𝐝.𝐚𝐥𝐢𝐚𝐬𝐞𝐬);
        𝐜𝐨𝐧𝐬𝐭 𝐚𝐮𝐭𝐡𝐨𝐫 = 𝐜𝐨𝐧𝐟𝐢𝐠𝐂𝐨𝐦𝐦𝐚𝐧𝐝.𝐚𝐮𝐭𝐡𝐨𝐫 || "𝐔𝐧𝐤𝐧𝐨𝐰𝐧";

        𝐜𝐨𝐧𝐬𝐭 𝐥𝐨𝐧𝐠𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧 = (𝐜𝐨𝐧𝐟𝐢𝐠𝐂𝐨𝐦𝐦𝐚𝐧𝐝.
